"""Крок 2
Надайте функції square_root_bisection такі параметри:

square_target: число, для якого ви хочете знайти квадратний корінь;
tolerance (необов’язковий параметр): припустима різниця між квадратом приблизного значення кореня та фактичним шуканим значенням (за замовчуванням 1e-7). Допуск 1e-7 позначає, що розв’язок буде точним у межах 0.0000001 від істинного значення і є хорошим вибором за замовчуванням, що збалансовує точність та продуктивність;
max_iterations (необов’язковий параметр): максимальна кількість ітерацій для виконання (за замовчуванням 100). Якщо метод не збігається з цим обмеженням, то припускають, що розв’язок не знайдено."""

def square_root_bisection(square_target, tolerance = 1e-7, max_iterations = 100):
    pass
