"""Крок 12
Як ви можете бачити з результату, .items() створює структуру даних, яка зберігає кожну пару ключ-значення в окремому кортежі. Щоб ітерувати над елементами в цих кортежах, ви можете додати другу змінну циклу:

Приклад коду
for i, j in dict.items():
    print(i, j)
Змініть цикл for, щоб він приймав дві змінні циклу та надрукував їх в межах тіла циклу."""

copper = {
    'species': 'guinea pig',
    'age': 2
}
copper['food'] = 'hay'
copper['species'] = 'Cavia porcellus'

for i, j in copper.items():
    print(i, j)