"""Крок 27
Алгоритм досліджує граф, але в той самий час він повинен відстежувати найкоротшу відстань між початковим вузлом та іншими вузлами, яка відома на цю мить.

Створіть нову змінну під назвою distances перед циклом for та призначте до неї порожній словник."""

my_graph = {
    'A': [('B', 3), ('D', 1)],
    'B': [('A', 3), ('C', 4)],
    'C': [('B', 4), ('D', 7)],
    'D': [('A', 1), ('C', 7)]
}

def shortest_path(graph, start):
    unvisited = []
    distances = {}
    for node in graph:
        unvisited.append(node)