"""Крок 38
Функція буде досліджувати всі вузли, приєднані до початкового вузла. Вона розрахує найкоротші шляхи для кожного з них. А потім вона видалить початковий вузол з невідвіданих вузлів.

Далі буде відвідано найближчий сусідній вузол, а процес повторюватиметься, допоки не будуть відвідані всі вузли.

Відтепер ви працюватимете над головним циклом, який досліджує вузли у графі. Щоб уникнути проблем з запуском нескінченного циклу під час розробки алгоритму, перетворіть виклик функції на коментар."""

my_graph = {
    'A': [('B', 3), ('D', 1)],
    'B': [('A', 3), ('C', 4)],
    'C': [('B', 4), ('D', 7)],
    'D': [('A', 1), ('C', 7)]
}
def shortest_path(graph, start):
    unvisited = list(graph)
    distances = {node: 0 if node == start else float('inf') for node in graph}
    paths = {node: [] for node in graph}
    paths[start].append(start)

    print(f'Unvisited: {unvisited}\nDistances: {distances}\nPaths: {paths}')

#shortest_path(my_graph, 'A')