"""Крок 28
Відстань від початкового вузла дорівнює нулю, оскільки алгоритм починає оцінювання саме звідти.

Після того, як ви додали node до unvisited в циклі, створіть інструкцію if, яка виконуватиметься, якщо вузол дорівнює початковому вузлу. Потім призначте 0 до цього вузла в межах словника distances."""

my_graph = {
    'A': [('B', 3), ('D', 1)],
    'B': [('A', 3), ('C', 4)],
    'C': [('B', 4), ('D', 7)],
    'D': [('A', 1), ('C', 7)]
}

def shortest_path(graph, start):
    unvisited = []
    distances = {}
    for node in graph:
        unvisited.append(node)
        if node == start:      # якщо це стартовий вузол
            distances[node] = 0