"""Крок 12
Словник — ще один вбудований тип даних у Python. Словник — це набір даних у вигляді пари ключ-значення. Словники визначають за допомогою фігурних дужок ({}), які містять пари ключ-значення, розділені комами. Після кожного ключа стоїть двокрапка (:) та значення:

Приклад коду
{'amount': 50.0, 'category': 'Food'}
У наведеному вище прикладі 'amount' та 'category' є ключами, а 50.0 та 'Food' є їхніми відповідними значеннями.

Створіть словник з ключем 'amount' та значенням параметра amount і передайте новий словник до виклику .append()."""

def add_expense(expenses, amount, category):
    expenses.append({'amount': amount})

expenses = []