"""Крок 6
Метод insert може додати елемент у будь-яку позицію в списку. Перший аргумент це позиція, в яку потрібно додати елемент, а другий аргумент це елемент, який потрібно додати. Наприклад, ось як додати новий елемент у третю позицію example_list:

Приклад коду
example_list = [4, 5, 6, 7]

example_list.insert(2, 5.5)

print(example_list) # [4, 5, 5.5, 6, 7]
Використовуючи insert(), додайте 1 до my_list у належному місці, щоб він рахувався вгору, а потім надрукуйте список."""

my_list = [1, 2]

my_list.append(3)
print(my_list)

print(my_list[0])

my_list[0] = 0
print(my_list)

my_list.insert(1, 1)
print(my_list)