"""Крок 1
Перш ніж почати проєкт, ви дізнаєтеся про списки.

На відміну від чисел та рядків, список є типом даних, який працює як вмістилище для інших значень:

Приклад коду
example_list = [1, 2, 3, 4]
empty_list = []
Список характеризується квадратними дужками навколо усіх значень та комою між значеннями, наприклад: ["A", "happy", "list"]. Якщо список не містить жодних значень, це порожній список: [].

Список може містити різні типи даних: [1, "Up", ["Down", "Twice"]]. Це включає усі можливі типи даних. Він також може містити інший список!

Створіть змінну під назвою my_list та призначте до неї порожній список."""

my_list = []