"""Крок 20
Граф називається зваженим, якщо його ребра пов’язані з вагою, яка представляє відстань, час або інше кількісне значення.

У цьому випадку вагою буде відстань між вузлами або точками в просторі. Щоб представити зважений граф, можна змінити словник, використовуючи список кортежів для кожного значення.

Першим елементом в кортежі буде приєднаний вузол, а другим елементом буде ціле число, яке вказує відстань.

Зробіть my_graph['A'] списком кортежів, припускаючи, що відстань A-B дорівнює 3, а відстань A-D дорівнює 1."""

my_graph = {
    'A': [('B', 3), ('D', 1)],
    'B': ['A', 'C'],
    'C': ['B', 'D'],
    'D': ['A', 'C']
}
