"""Крок 6
Щоб додати нову пару ключ-значення після оголошення словника, можна вказати ключ (так само як при отриманні наявного ключа) і встановити значення нового ключа за допомогою оператора присвоєння:

Приклад коду
my_dict = {
    'name': 'Michael',
    'occupation': 'Lumberjack'
}

my_dict['country'] = 'Canada'
Видаліть виклик print(). Потім, після оголошення copper, додайте ключ 'food' до словника та встановіть його значення на 'hay'."""

copper = {
    'species': 'guinea pig',
    'age': 2
}
copper['food'] = 'hay'