"""Крок 4
У **camel case** та **pascal case** великі літери позначають початок нових слів. Щоб перетворити вхідний рядок у **snake case**, потрібно перевіряти, чи є символи у рядку великими літерами.

Для цього можна використати метод рядків **`.isupper()`**, який повертає **True**, якщо символ є великою літерою, і **False**, якщо ні.

Всередині циклу **for** додайте умовний оператор **if**, щоб перевірити, чи поточний символ є великою літерою. Перемістіть оператор **pass** усередину нового блоку **if**.
"""

def convert_to_snake_case(pascal_or_camel_cased_string):
    snake_cased_char_list = []
    for char in pascal_or_camel_cased_string:
        if char.isupper():
            pass