"""Крок 1
У цьому проєкті ви створите програму, яка відформатовує рядок у верблюдячомуРегістрі (camelCase) або РегістріПаскаля (PascalCase) в зміїний_регістр (snake_case), використовуючи два підходи. Спочатку ви будете використовувати цикл for, а потім — розуміння списку. Ви побачите, як розуміння списку може зробити код більш лаконічним.

Для початку визначте нову функцію під назвою convert_to_snake_case(), яка приймає рядок під назвою pascal_or_camel_cased_string як вхідні дані. Наразі додайте інструкцію pass до функції."""


def convert_to_snake_case(pascal_or_camel_cased_string):
    pass