"""Крок 31
Якщо ви спробуєте змінити окремі символи рядка, як це було зроблено в попередньому кроці, ви отримаєте помилку TypeError,
яка виникає, коли у коді використано об’єкт невідповідного типу.

Як видно з повідомлення помилки, рядки не підтримують призначення елементів, оскільки вони незмінні.
Однак змінній можна присвоїти інший рядок:

Приклад коду
message = 'Hello World'
message = 'Hello there!'
Видали рядок text[0] і перепризнач змінну text рядком 'Albatross'."""

text = 'Hello World'
text = 'Albatross'