"""Крок 13
Ви будете використовувати метод .find(), щоб знайти позицію кожної літери з повідомлення в алфавіті.
Метод схожий на функцію, але належить до об’єкта.

Приклад коду
sentence = 'My brain hurts!'
sentence.find('r')
У прикладі вище, метод .find() викликаний на sentence (рядок, де відбувається пошук), а 'r' (символ, який потрібно знайти) передано як аргумент.
Виклик sentence.find('r') поверне 4, що є індексом першого випадку, коли в sentence зустрічається 'r'.

В кінці коду викличте .find() на alphabet та передайте 'z' як аргумент до методу."""
text = 'Hello World'
shift = 3
alphabet = 'abcdefghijklmnopqrstuvwxyz'
alphabet.find('z')
