"""Крок 23
Цикл дозволяє систематично проходити послідовність елементів і виконувати дії над кожним з них.

У цьому випадку ви використаєте цикл for. Ось так ви можете ітерувати над text:

Приклад коду
for i in text:
for — це ключове слово, яке позначає тип циклу. i — це змінна, яка послідовно приймає значення елементів у text. Інструкція закінчується двокрапкою :.

Під рядком, де ви оголосили alphabet, напишіть цикл for, щоб ітерувати над text. Використайте i як змінну циклу.

Внаслідок в терміналі виникне помилка. Ви дізнаєтеся про це в наступному кроці."""
text = 'Hello World'
shift = 3
alphabet = 'abcdefghijklmnopqrstuvwxyz'
for i in text:
    pass