"""Крок 17
.find() повертає індекс відповідного символу всередині рядка.
Якщо символ не знайдено, повертається -1.
Як бачите, перший символ в text ('H' у верхньому регістрі) не знайдено, оскільки alphabet містить літери лише в нижньому регістрі.

Ви можете перетворити рядок на його еквівалент у нижньому регістрі за допомогою методу .lower().
Додайте ще один виклик print(), щоб надрукувати text.lower() та подивіться на результат."""
text = 'Hello World'
shift = 3
alphabet = 'abcdefghijklmnopqrstuvwxyz'
index = alphabet.find(text[0])
print(index)
print(text.lower())