"""Крок 12
Ключові аспекти найменування змінних в Python:

Деякі слова є зарезервованими ключовими словами (наприклад, for, while, True).
Вони мають особливе значення в Python, тому їх не можна використовувати для назв змінних.
Назви змінних не можуть починатися з числа та можуть містити лише буквено-цифрові символи або підкреслення.
Назви змінних чутливі до регістру, тобто my_var відрізняється від my_Var та MY_VAR.
Часто назви змінних пишуть за допомогою snake_case (укр. зміїного_регістру), де пробіл замінюється підкресленням, а слова записані малими літерами.
Видаліть обидва виклики print() та оголосіть ще одну змінну під назвою alphabet. Призначте рядок 'abcdefghijklmnopqrstuvwxyz' до цієї змінної."""
text = 'Hello World'
shift = 3
alphabet = 'abcdefghijklmnopqrstuvwxyz'