"""Крок 5
На кожен символ рядка можна посилатися за допомогою числового індексу.
Відрахунок індексу починається з нуля. Тобто, перший символ рядка має індекс 0.
Наприклад, в рядку 'Hello World': 'H' має індекс 0, 'e' має індекс 1 і так далі.

До кожного символу рядка можна отримати доступ за допомогою дужкової нотації.
Вам потрібно написати назву змінної, а потім квадратні дужки та додати індекс символу між дужками:

Приклад коду
text = 'Hello World'
r = text[8]
Тепер виведіть символ за індексом 6, а не text."""
text = "Hello World"
print(text[6])