"""Крок 14 Пройдено
Перший тип шифру, який ти створиш, називається шифр Цезаря.
Зокрема, ти візьмеш кожну літеру у своєму повідомленні, знайдеш її позицію в алфавіті,
візьмеш літеру, що знаходиться на 3 позиції далі в алфавіті, і заміниш оригінальну літеру на нову.

Щоб реалізувати це, ти використаєш метод .find(), про який йшлося на попередньому кроці.
Змініть наявний виклик .find(), передаючи йому text[0] як аргумент замість 'z'"""

text = 'Hello World'
shift = 3
alphabet = 'abcdefghijklmnopqrstuvwxyz'
alphabet.find(text[0])
