"""Крок 2
Змінні можуть зберігати значення різних типів даних.
Ви щойно призначили ціле число, але якщо хочете представити якийсь текст, вам потрібно призначити рядок.
Рядки — це послідовності символів, взятих в одинарні або подвійні лапки, але не можна починати рядок з одинарних лапок,
а закінчувати його подвійними лапками або навпаки:

Приклад коду
string_1 = "I am a string"
string_2 = 'I am also a string'
string_3 = 'This is not valid"
Видаліть змінну number та її значення. Потім оголосіть іншу змінну text та призначте цій змінній значення 'Hello World'."""
text = 'Hello world'