"""Крок 2
Ви можете отримати доступ до утиліт, визначених в межах імпортованого модуля, за допомогою точкової нотації. Щоб застосувати точкову нотацію, додайте до назви модуля крапку, після якої напишіть назву утиліти. Наприклад, ось як отримати доступ до константи ascii_lowercase:

Приклад коду
import string


print(string.ascii_lowercase)
# Output: abcdefghijklmnopqrstuvwxyz
У цьому проєкті ви будете використовувати різні константи з модуля string.

Оголосіть нову змінну під назвою letters і призначте до неї string.ascii_letters."""

import string

letters = string.ascii_letters