"""Крок 3
Python постачається з вбудованими класами, які можуть допомогти маніпулювати рядками. Одним із них є клас str. Він має метод під назвою maketrans, який може допомогти створити таблицю перекладу. Цю таблицю можна використовувати для заміни символів у рядку:

Приклад коду
str.maketrans({'t': 'c', 'l': 'b'})
Вищезазначене під час виклику на рядку замінить всі символи t на c та всі символи l на b.

Створіть змінну під назвою card_translation і призначте до неї таблицю перекладу, щоб замінити всі символи - та `` на порожній рядок."""

def main():
    card_number = '4111-1111-4555-1142'
    card_translation = str.maketrans({'-': '', ' ': ''})