"""Крок 3
Головоломка починається з того, що на першому стрижні зібрані диски в спадному порядку (найменший диск розташований зверху, а найбільший — внизу). Заповніть перший список числами, що представляють різні розміри дисків.

Замість того, щоб додавати елементи до першого списку вручну, створіть множину чисел зі зворотним відліком від 3 до 1 за допомогою функції range() та призначте цю множину до rods['A']. Цифра 3 представляє найбільший диск внизу, а 1 представляє найменший диск зверху.

Синтаксис такий: range(x, y, h), де x — початкове ціле число (включно), y — останнє ціле число (виключно), а h — це різниця між числом та наступним числом множини."""

rods = {
    'A': range(3, 0, -1),
    'B': [],
    'C': []
}