"""Крок 7
Мета Ханойської вежі — перемістити всі диски на останній стрижень. Для цього необхідно дотримуватися трьох простих правил:

Можна переміщати диски лише з самого верху
Можна переміщати лише один диск за раз
Більші диски не можна класти поверх менших
Під наявним кодом оголосіть порожню функцію під назвою move. Пізніше ви будете використовувати цю функцію, щоб переміщувати диски між стрижнями. Наразі, щоб уникнути помилок, використайте ключове слово pass в тілі функції."""

rods = {
    'A': list(range(3, 0, -1)),
    'B': [],
    'C': []
}
def move():
    pass